UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples_driverlib/examples/flash/flash_programming_f28004x.h
//###########################################################################
//
// FILE:   flash_programming_c28_F28004x.h
//
//###########################################################################

// Bank0 Sector start addresses
#define Bzero_Sector0_start	        0x80000
#define Bzero_Sector1_start	        0x81000
#define Bzero_Sector2_start	        0x82000
#define Bzero_Sector3_start	        0x83000
#define Bzero_Sector4_start	        0x84000
#define Bzero_Sector5_start	        0x85000
#define Bzero_Sector6_start	        0x86000
#define Bzero_Sector7_start	        0x87000
#define Bzero_Sector8_start	        0x88000
#define Bzero_Sector9_start	        0x89000
#define Bzero_Sector10_start	    0x8A000
#define Bzero_Sector11_start	    0x8B000
#define Bzero_Sector12_start	    0x8C000
#define Bzero_Sector13_start	    0x8D000
#define Bzero_Sector14_start	    0x8E000
#define Bzero_Sector15_start	    0x8F000

// Bank1 Sector start addresses
#define Bone_Sector0_start	        0x90000
#define Bone_Sector1_start	        0x91000
#define Bone_Sector2_start	        0x92000
#define Bone_Sector3_start	        0x93000
#define Bone_Sector4_start	        0x94000
#define Bone_Sector5_start	        0x95000
#define Bone_Sector6_start	        0x96000
#define Bone_Sector7_start	        0x97000
#define Bone_Sector8_start	        0x98000
#define Bone_Sector9_start	        0x99000
#define Bone_Sector10_start	        0x9A000
#define Bone_Sector11_start	        0x9B000
#define Bone_Sector12_start	        0x9C000
#define Bone_Sector13_start	        0x9D000
#define Bone_Sector14_start	        0x9E000
#define Bone_Sector15_start	        0x9F000

//Sector length in number of 32bits
#define Sector8KB_u32length   0x800
